In [12]:
import pandas as pd
import os
from catboost import CatBoostRegressor

In [2]:
data_path = 'D:/DATA SCIENSE/ml_sim/medium/03_sku_price_prediction/data/'

In [3]:
os.listdir(data_path)

['conc_df.csv',
 'first_group_sku.csv',
 'promo_1510002.csv',
 'second_group_sku.csv',
 'sku_dict.csv',
 'test.csv',
 'third_group_sku.csv']

In [4]:
test = pd.read_csv(data_path + 'test.csv')

In [5]:
first_group_sku = pd.read_csv(data_path + 'first_group_sku.csv')
second_group_sku = pd.read_csv(data_path + 'second_group_sku.csv')
third_group_sku = pd.read_csv(data_path + 'third_group_sku.csv')

In [6]:
train = pd.concat([first_group_sku, second_group_sku, third_group_sku])

In [7]:
train

           dates    SKU  price_per_sku  num_purchases
0     2018-04-20  32950        422.975              3
1     2018-04-24  32950        429.275              3
2     2018-04-27  32950        435.100              3
3     2018-04-30  32950            NaN              1
4     2018-05-03  32950        440.950              2
...          ...    ...            ...            ...
2776  2019-12-17  89272        124.996              5
2777  2019-12-18  89272        124.996              6
2778  2019-12-19  89272        124.996              5
2779  2019-12-20  89272        124.996              6
2780  2019-12-21  89272        124.996              6

[6775 rows x 4 columns]

In [17]:
predict = train.groupby('SKU')['price_per_sku'].mean().to_dict()

In [22]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 175 entries, 0 to 174
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dates   175 non-null    object
 1   SKU     175 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.9+ KB

In [23]:
predict

{10334: 96.13861031390135,
 11050: 105.9856728110599,
 17812: 73.7919329032258,
 19632: 156.64278823529412,
 24125: 109.44264444444444,
 32950: 454.7423809523809,
 36096: 132.16805789473685,
 38767: 68.1654007430998,
 43678: 145.07111811023623,
 49661: 160.69191324200915,
 54404: 83.58744905660377,
 57561: 95.11115488372093,
 60870: 112.21786292834891,
 64619: 150.9417843137255,
 68211: 161.86045568627452,
 69997: 135.500425,
 72784: 128.74046741344196,
 78833: 307.276171875,
 80308: 117.76484473684211,
 80631: 88.97601840490798,
 83329: 85.29272412587413,
 84395: 135.82664464692482,
 89272: 120.94687209302326,
 90611: 88.81867673160173,
 98255: 67.03469230769231}

In [27]:
test['price_per_sku'] = test['SKU'].map(predict)

In [29]:
test.to_csv('predict.csv', index=False)

In [30]:
pd.read_csv('predict.csv')

          dates    SKU  price_per_sku
0    2018-12-17  98255      67.034692
1    2018-12-21  98255      67.034692
2    2018-12-22  98255      67.034692
3    2018-12-23  98255      67.034692
4    2018-12-24  98255      67.034692
..          ...    ...            ...
170  2019-12-31  80631      88.976018
171  2019-12-31  19632     156.642788
172  2019-12-31  84395     135.826645
173  2019-12-31  43678     145.071118
174  2019-12-31  49661     160.691913

[175 rows x 3 columns]

# Score = 5.766. (RMSE)